package com.jiage.weather.gson;

public class Lifestyle {
    public String type;
    public String brf;
    public String txt;
}
/*
{
"HeWeather6":[
{
"basic":{"cid":"CN101200804","location":"石首","parent_city":"荆州","admin_area":"湖北","cnty":"中国","lat":"29.71643639","lon":"112.40886688","tz":"+8.00"},
"update":{"loc":"2019-01-14 14:57","utc":"2019-01-14 06:57"},
"status":"ok",
"lifestyle":[
{"type":"comf","brf":"较舒适","txt":"白天会有降雨，这种天气条件下，人们会感到有些凉意，但大部分人完全可以接受。"},
{"type":"drsg","brf":"冷","txt":"天气冷，建议着棉服、羽绒服、皮夹克加羊毛衫等冬季服装。年老体弱者宜着厚棉衣、冬大衣或厚羽绒服。"},
{"type":"flu","brf":"易发","txt":"天冷空气湿度大，易发生感冒，请注意适当增加衣服，加强自我防护避免感冒。"},
{"type":"sport","brf":"较不宜","txt":"有降水，且风力较强，较适宜在户内进行各种健身休闲运动；若坚持户外运动，请注意保暖。"},
{"type":"trav","brf":"一般","txt":"天气稍凉，风稍大会加大些凉意，且预报有降水，旅游指数一般，外出旅游请注意防风保暖并携带雨具。"},
{"type":"uv","brf":"最弱","txt":"属弱紫外线辐射天气，无需特别防护。若长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},
{"type":"cw","brf":"不宜","txt":"不宜洗车，未来24小时内有雨，如果在此期间洗车，雨水和路上的泥水可能会再次弄脏您的爱车。"},
{"type":"air","brf":"良","txt":"气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。"}]
}]}
 */
